//------------------------------------------------------------------
// 2026 1학기 STL				3월 31일					(5주 1일)
//------------------------------------------------------------------
// 호출가능한 타입 - callable type
// 1. 함수
// 2. lambda - 이름 없는 함수
// 3. 함수 호출 연산자를 오버로딩 한 클래스
// 4. 멤버 함수 포인터
// 
// 통합하여 function 클래스로 사용
//------------------------------------------------------------------

#include <iostream>

#include "save.h"

class XYZ {
public:
	void operator()( ) {
		std::cout << "안녕 난 람다야" << std::endl;
	}
};

int main( )
{
	XYZ a;
	a( );
	std::cout << typeid( a ).name( ) << std::endl;

	save("main.cpp");		// "메인.cpp"를 저장하자
}